# **Data Cleaning**

- While working on a Machine Learning & Data Science project, we might come across an unbalanced data i.e. have null data values or  missing data values or any inappropriate data values etc. 
- So, it becomes important to balance the data before moving to Data Creation & Model creation steps.
-This tutorial will help understand how to clean such data and improve performance of the project.


Here, with a sample dataset let's understand how to clean the data by following steps:

-  Data preprocessing and exploration to understand what kind of data will we working on.
-  Data Preparation which will include data cleaning whichin we will be finding all null data values and clean them.

For the dataset being used  [click here](https://www.kaggle.com/benroshan/factors-affecting-campus-placement)

### **Data Preprocessing & Exploration**

In [1]:
#importing pandas library.
import pandas as pd

In [2]:
#loading and reading data through following
data=pd.read_csv('/content/Placement_Data_Full_Class.csv')
data

     sl_no gender  ssc_p    ssc_b  ...  specialisation  mba_p      status    salary
0        1      M  67.00   Others  ...          Mkt&HR  58.80      Placed  270000.0
1        2      M  79.33  Central  ...         Mkt&Fin  66.28      Placed  200000.0
2        3      M  65.00  Central  ...         Mkt&Fin  57.80      Placed  250000.0
3        4      M  56.00  Central  ...          Mkt&HR  59.43  Not Placed       NaN
4        5      M  85.80  Central  ...         Mkt&Fin  55.50      Placed  425000.0
..     ...    ...    ...      ...  ...             ...    ...         ...       ...
210    211      M  80.60   Others  ...         Mkt&Fin  74.49      Placed  400000.0
211    212      M  58.00   Others  ...         Mkt&Fin  53.62      Placed  275000.0
212    213      M  67.00   Others  ...         Mkt&Fin  69.72      Placed  295000.0
213    214      F  74.00   Others  ...          Mkt&HR  60.23      Placed  204000.0
214    215      M  62.00  Central  ...          Mkt&HR  60.22  Not Placed       NaN

[215 rows x 15 columns]

In [3]:
#to view shape of the dataset i.e. total number of rows and columns.
data.shape

(215, 15)

In [4]:
#to view first 5 rows of the dataset.
data.head()

   sl_no gender  ssc_p    ssc_b  ...  specialisation  mba_p      status    salary
0      1      M  67.00   Others  ...          Mkt&HR  58.80      Placed  270000.0
1      2      M  79.33  Central  ...         Mkt&Fin  66.28      Placed  200000.0
2      3      M  65.00  Central  ...         Mkt&Fin  57.80      Placed  250000.0
3      4      M  56.00  Central  ...          Mkt&HR  59.43  Not Placed       NaN
4      5      M  85.80  Central  ...         Mkt&Fin  55.50      Placed  425000.0

[5 rows x 15 columns]

In [5]:
#to view last 5 rows of the dataset.
data.tail()

     sl_no gender  ssc_p    ssc_b  ...  specialisation  mba_p      status    salary
210    211      M   80.6   Others  ...         Mkt&Fin  74.49      Placed  400000.0
211    212      M   58.0   Others  ...         Mkt&Fin  53.62      Placed  275000.0
212    213      M   67.0   Others  ...         Mkt&Fin  69.72      Placed  295000.0
213    214      F   74.0   Others  ...          Mkt&HR  60.23      Placed  204000.0
214    215      M   62.0  Central  ...          Mkt&HR  60.22  Not Placed       NaN

[5 rows x 15 columns]

In [6]:
#to view different columns of the dataset.
data.columns

Index(['sl_no', 'gender', 'ssc_p', 'ssc_b', 'hsc_p', 'hsc_b', 'hsc_s',
       'degree_p', 'degree_t', 'workex', 'etest_p', 'specialisation', 'mba_p',
       'status', 'salary'],
      dtype='object')

In [7]:
#to view memory usage, non-null values, datatypes of columns.
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 215 entries, 0 to 214
Data columns (total 15 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   sl_no           215 non-null    int64
 1   gender          215 non-null    object
 2   ssc_p           215 non-null    float64
 3   ssc_b           215 non-null    object
 4   hsc_p           215 non-null    float64
 5   hsc_b           215 non-null    object
 6   hsc_s           215 non-null    object
 7   degree_p        215 non-null    float64
 8   degree_t        215 non-null    object
 9   workex          215 non-null    object
 10  etest_p         215 non-null    float64
 11  specialisation  215 non-null    object
 12  mba_p           215 non-null    float64
 13  status          215 non-null    object
 14  salary          148 non-null    float64
dtypes: float64(6), int64(1), object(8)
memory usage: 25.3+ KB

In [8]:
#to view statistical summary of the dataset.
data.describe()

            sl_no       ssc_p  ...       mba_p         salary
count  215.000000  215.000000  ...  215.000000     148.000000
mean   108.000000   67.303395  ...   62.278186  288655.405405
std     62.209324   10.827205  ...    5.833385   93457.452420
min      1.000000   40.890000  ...   51.210000  200000.000000
25%     54.500000   60.600000  ...   57.945000  240000.000000
50%    108.000000   67.000000  ...   62.000000  265000.000000
75%    161.500000   75.700000  ...   66.255000  300000.000000
max    215.000000   89.400000  ...   77.890000  940000.000000

[8 rows x 7 columns]

## **Data Preparation**

In [10]:
#to check for any missing or null values in the dataset.
data.isnull().sum()

sl_no              0
gender             0
ssc_p              0
ssc_b              0
hsc_p              0
hsc_b              0
hsc_s              0
degree_p           0
degree_t           0
workex             0
etest_p            0
specialisation     0
mba_p              0
status             0
salary            67
dtype: int64

There are 67 null values in 'salary', we can't proceed with this.

We need to replace the null values by the mean of that respective column.

In [11]:
data['salary'].isnull().sum()

67

In [12]:
data['salary'].mean()

288655.4054054054

In [13]:
data['salary'].fillna('288655',inplace=True)
# fillna fucntion will fill the null values(where null=TRUE) with the mean value.

In [14]:
data['salary'].isnull().sum()

0

In [15]:
#to check again for any missing or null values in the dataset.
data.isnull().sum()

sl_no             0
gender            0
ssc_p             0
ssc_b             0
hsc_p             0
hsc_b             0
hsc_s             0
degree_p          0
degree_t          0
workex            0
etest_p           0
specialisation    0
mba_p             0
status            0
salary            0
dtype: int64

In [16]:
#to view total null values in the dataset.
data.isnull().sum().sum()

0

Now that the dataset has no null values i.e. dataset is cleaned and proper.

We can now proceed with further steps as data training & model creation.